tutorials/compressible/sonicFoam/forwardStep/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
inlet
{
    type patch;
    nFaces 50;
    startFace 10325;
}

outlet
{
    type patch;
    nFaces 40;
    startFace 10375;
}

bottom
{
    type symmetryPlane;
    nFaces 25;
    startFace 10415;
}

top
{
    type symmetryPlane;
    nFaces 125;
    startFace 10440;
}

obstacle
{
    type patch;
    nFaces 110;
    startFace 10565;
}

defaultFaces
{
    type empty;
    nFaces 10500;
    startFace 10675;
}
)

// ************************************************************************* //
